In [4]:
import numpy as np 
import pandas as pd

In [3]:
state_data = {'State':['Alabama','Alaska','Arizona','Arkansas'],'PostCode':['AL','AK','AZ','AR'],'Area':['52,423','656,424','*','53,182'],'Pop':['4,040,587','550,043','3,665,228','2,350,750']}

In [6]:
# create dataframe 
stdf = pd.DataFrame(state_data,columns=['State','PostCode','Area','Pop'])
# display the table 
stdf

      State PostCode     Area        Pop
0   Alabama       AL   52,423  4,040,587
1    Alaska       AK  656,424    550,043
2   Arizona       AZ        *  3,665,228
3  Arkansas       AR   53,182  2,350,750

In [7]:
stdf['Area']

0     52,423
1    656,424
2          *
3     53,182
Name: Area, dtype: object

In [8]:
stdf.Area

0     52,423
1    656,424
2          *
3     53,182
Name: Area, dtype: object

In [9]:
# index by state 
stdf = stdf.set_index('State')

In [10]:
# replace the * with 0 
stdf =stdf.replace('*','0')
stdf

         PostCode     Area        Pop
State
Alabama        AL   52,423  4,040,587
Alaska         AK  656,424    550,043
Arizona        AZ        0  3,665,228
Arkansas       AR   53,182  2,350,750

In [11]:
# Define a function to replace ',' with ''.
def item_replace(xstr):
     return xstr.replace(',','')

In [13]:
stdf['Area'] = stdf['Area'].map(item_replace)
stdf

         PostCode    Area        Pop
State
Alabama        AL   52423  4,040,587
Alaska         AK  656424    550,043
Arizona        AZ       0  3,665,228
Arkansas       AR   53182  2,350,750

In [15]:
# replace the , in area and pop
stdf['Pop'] = stdf['Pop'].map(item_replace)
stdf

         PostCode    Area      Pop
State
Alabama        AL   52423  4040587
Alaska         AK  656424   550043
Arizona        AZ       0  3665228
Arkansas       AR   53182  2350750

In [17]:
stdf[['Area','Pop']] = stdf[['Area','Pop']].astype(float)
stdf

         PostCode      Area        Pop
State
Alabama        AL   52423.0  4040587.0
Alaska         AK  656424.0   550043.0
Arizona        AZ       0.0  3665228.0
Arkansas       AR   53182.0  2350750.0

In [18]:
mean_area = stdf['Area'].mean()
mean_area

190507.25

In [19]:
stdf['Area'] = stdf.Area.mask(stdf.Area == 0, mean_area)
stdf

         PostCode       Area        Pop
State
Alabama        AL   52423.00  4040587.0
Alaska         AK  656424.00   550043.0
Arizona        AZ  190507.25  3665228.0
Arkansas       AR   53182.00  2350750.0